#變數宣告
a = 0 ; b = 10
x = y = z = 20
age , name = 18 , "WangHow"
#---------------------------------------
print(a, b)
print(x, y, z)
print(age, name)
print("--------------------------------------------------")

#資料型別
N1 = 2.45
N2 = True
N3 = False
N4 = "程式設計"
print(type(N1))
print(type(N2))
print(type(N3))
print(type(N4))
print("--------------------------------------------------")

#True = 1,False = 0
N5 = 24 + True
N6 = 24 + False
print(N5)
print(N6)
#---------------------------------------
print("--------------------------------------------------")

#資料型別轉換
R1 = 36
R2 = 36 + int("4")
print(R1)
print(R2)
print("--------------------------------------------------")

#print
print(100, "分", 666, sep="-", end=" OuO~")
print(str(100) + "分",666)
print("--------------------------------------------------")

#print參數格式化
    # %s = 字串
    # %d = 整數
    # %f = 浮點數
    # 負號是靠左對齊
p = 85
print("%s的成績為%d分" % (name, p) )
print("%8s的成績為%3d分" % (name, p) )
print("%8s 的成績為%3d 分" % (name, p) )
print("%-8s的年齡為 %-3d歲" % (name, age) )
#---------------------------------------
print("My BMI:%f" %(20))
print("My BMI:%.2f" %(20))#取2位小數四捨五入
print("My BMI:%6.2f" %(20))
print("--------------------------------------------------")

#print 參數格式化 [format]
    #{索引值}
    #f"{變數}"
print("{}成績是{}" .format(name, p))
print("{1}成績是{0}" .format(p, name))
print("{0:8s}成績是{1:6.2f}" .format(name, 84.628))
print(f"{name:8s}成績是{p:6.2f}")
print("--------------------------------------------------")

    #作業 - 列印整齊表格_1
G1, G2, G3 = "林大名", "陳阿忠", "張小英"
print("姓名   座號  國文  數學  英文")
print("%-4s%4d%6d%6d%6d" % (G1, 1, 100, 87, 79))
print("%-4s%4d%6d%6d%6d" % (G2, 2, 74, 88, 100))
print("%-4s%4d%6d%6d%6d" % (G3, 11, 82, 65, 8))
print("--------------------------------------------------")

    #作業 - 列印整齊表格_2
print("年度   所得稅   營業稅   證交稅")
print("%-8s%.2f%9.2f%9.2f" % (2017, 98.34, 90.2, 104.79))
print("%-8s%.2f%9.2f%9.2f" % (2016, 83, 110.5, 82.45))
print("%-8s%.2f%9.2f%9.2f" % (2015, 98, 79.32, 102))